Repository: kicsyromy/tapet
Catalog: po/*.po
Languages: ro_ro

source: Tapet failed to initialize properly
ro_ro: Inițializarea aplicației a eșuat

source: Failed to create cache directory
ro_ro: Crearea unui director de cache a eșuat

source: Menu
ro_ro: Meniu

source: Settings...
ro_ro: Setări...

source: About Tapet
ro_ro: Despre Tapet

source: Download folder
ro_ro: Director descărcări

source: Save as...
ro_ro: Salvează...

source: Open
ro_ro: Deschide

source: Close
ro_ro: Închide

source: Cancel
ro_ro: Anulează

source: Quit
ro_ro: Ieșire

source: Tapet Wallpaper Manager
ro_ro: Tapet, Administrator al Imaginilor de Fundal

source: Download and apply wallpapers from popular online sources
ro_ro: Descarcă și aplică imagini de fundal de pe surse populare online

source: Tapet;Wallpaper;
ro_ro: Tapet;Fundal;Imagine Fundal;
